import React from "react";
import categoriesData from "../../categories.json";
import Image from "next/image";

interface Category {
  jakoImage?: string;
  imageAlt?: string;
  titleSection?: string;
  smallTitle?: string;
}

const AboutUs = () => {
  if (categoriesData.length === 0) {
    return null;
  }

  const aboutUsComponent: Category = categoriesData[0];

  return (
    <section>
      <h1 className="text-3xl text-white">
        საქართველოს ბარმენთა ასოციაციის ისტორია
      </h1>
      <Image
        src={"/jako.jpg"}
        alt={`${aboutUsComponent.imageAlt}`}
        width={300}
        height={300}
        className="h-[300px] w-[400px] object-contain mb-4 mt-4"
      />
      <div className="text-xl text-white">
        საქართველოს ბარმენთა ასოციაციის დამფუძნებელი
      </div>
      <p className="text-white mt-4">
        ბატონი ჟაკო ჯორჯაძე დაიბადა ლაგოდეხში, მაგრამ თბილისში გაიზარდა. შრომას
        ბავშვობიდან შეეჩვია. სკოლაში დადიოდა და პარალელურად სხვადასხვა საქმეს
        აკეთებდა, არც მძღოლობა უთაკილია. მერე ისე მოხდა, რომ უცხო ენების
        ინსტიტუტში ფრანგულის სპეციალობაზე ჩააბარა. მეოთხე კურსიდან კი ბარში
        მუშაობა შესთავაზეს… სწორედ აქედან გადაეჯაჭვა მისი ბედი ბარმენის ბედს…
        ყველგან იღბალი თან სდევდა… წარმატებული ბარმენი იყო, საქართველოს ბარმენთა
        ასოციაცია და სკოლა შექმნა, ახალი კოქტეილები გამოიგონა, სახელმძღვანელოები
        დაწერა… გული სწყდება, რომ ჩვენს ბარებში ხშირად ამახინჯებენ რეცეპტებს და
        კოქტეილსაც ის გემო არ აქვს, რაც უნდა ჰქონდეს… არადა, ტურიზმის
        განვითარებასთან ერთად, ბარზე მოთხოვნილება იზრდება… დიდი სურვილი აქვს,
        რომ მეღვინეობის სამშობლოში ღვინოზე დაყენებული უნიკალური კოქტეილები
        შეიქმნას.
      </p>
      <p className="text-white mt-4">
        ახლახან საქართველოს ბარმენთა ასოციაცია მსოფლიოს ბარმენთა ასოციაციაში
        მიიღეს და საზრუნავი გაასმაგდა. ბარმენთა ასოცოაცია 2002 წლის 2 ივლისს
        დაარსა ჟაკო ჯორჯაძემ. მსოფლიოს ბარმენთა ასოციაცია ლონდონში 1951 წელს
        შეიქმნა. დაახლოებით 7 ქვეყანა იყო პირველი, ვინც მასში გაერთიანდა და
        დაარქვეს ბარმენთა საერთაშორისო ასოციაცია. დღეისათვის ასოციაციაში უკვე
        70-მდე წევრია. ასოაციაცია მსოფლიოს სიახლეებს აკვირდება, უგზავნის
        რეკომანდაციებს თავის წევრებს ამა თუ იმ სფეროში, ეს იქნება ახალი კოქტეილი
        თუ რამე ცვლილებები პროგრამაში. საქართველო სამი წელი იყო, როგორც
        დამკვირვებელი, წესით, მესამე წელს, 2018-ში უნდა გავწევრიანებულიყავით…
        მაგრამ კოპენჰაგენში გამართულ შეხვედრაზე ჩვენი დელეგაციისთვის მოულოდნელად
        პრეზიდენტმა რონალდ ბუსმანმა გამოაცხადა, რომ საქართველო გახდა მსოფლიო
        ასოციაციის ოჯახის წევრი. ბუსმანი ჰოლანდიელია, რომელიც მრავალჯერ
        სტუმრობდა საქართველოს, კარგად გაიცნო ჩვენი ქვეყანა და მასტერკლასებიც
        ჩაგვიტარა. ანუ სამი წელი უნდა ვყოფილიყავით, როგორც კანდიდატი ქვეყანა და
        1 წლით ადრე შეგვიყვანეს ასოციაციაში. მოულოდნელად გადაწყვიტეს, ალბათ
        გაითვალისწინეს ჩვენი აქტიურობა, ჩვენ ვგზავნით ხოლმე ინფორმაციას ცენტრში,
        ნახეს, რომ ვმუშაობთ, მოეწონათ და გაგვაწევრიანეს, ჩვენ ვართ რიგით 67
        ქვეყანა ვინც გაწევრიანდა მსოფლიო ბარმრნთა ასოციაციაში.
      </p>
    </section>
  );
};

export default AboutUs;
